{"basics":{"name":"Evert Lammerts","label":"","image":"","email":"evert.lammerts[at]gmail.com","url":"https://evert.lammerts.online/","summary":"I'm a staff-level software engineer, founder and consultant. I'm curious, product-minded and entrepreneurial, dedicated to- and motivated by solving complex problems that matter (what Seymour Papert called \"<a href=\"https://dailypapert.com/hard-fun/\">hard fun</a>\"). I feel at home in teams working on or with distributed systems, large-scale computing and data processing infrastructures, cryptosystems, and even a little mechatronics. I'm currently available for fixed-term freelance projects.","location":{"city":"Amsterdam","countryCode":"NL"},"profiles":[{"network":"linkedin","username":"evertlammerts","url":"https://www.linkedin.com/in/evertlammerts/"},{"network":"github","username":"evertlammerts","url":"https://github.com/evertlammerts/"}]},"work":[{"name":"Uber","position":"Engineering Manager","url":"https://www.uber.com/be/en/careers/locations/amsterdam/","startDate":"2021-10","endDate":"2024-03","summary":"I was manager of the Earnings Data Intelligence team, a team of talented backend engineers. The team built and ran the systems that powered several critical earnings-related features for Uber's earners, i.e. drivers and couriers. Important features included real-time trip earnings summaries and historical earnings reports, but also highly localized earnings forecasts generated using large-scale machine learning pipelines. At the core of the data was a complex taxonomy that models earnings specific to all of the 70+ markets that Uber still operates in, allowing Uber and its earners to comply with all rules and regulations specific to the earners locality. As engineering manager I was responsible for all aspects of this team's health, from the psychological safety and personal growth of its members to the team's vision, mission and execution, both tactical and strategical.","highlights":["Engineering management","Complex taxonomies","Mission critical real-time features","Machine Learning"]},{"name":"Uber","position":"Software Engineer","url":"https://www.uber.com/be/en/careers/locations/amsterdam/","startDate":"2018-07","endDate":"2021-10","summary":"I was a senior / lead engineer on the Tokenizer team, a small team of ~5 backend engineers and ~4 devops engineers, on its own little hyper secure island. We designed, built and ran Tokenizer, Uber's bank card vault, which held 100s of millions of card numbers, bank account numbers and other tier 1 sensitive PII like SSNs. Tokenizer was (and to my knowledge, still is) on the critical path for both collections (from riders and eaters) and disbursements (to drivers and couriers). Given the very large scale of card processing at Uber, Tokenizer contributed huge savings by not depending on third party vaults and by allowing integrations with many different local card processors and banks around the world, without trading off stability, availability and security (Tokenizer is, of course, PCI compliant and as such is extensively audited every year). I worked on many features of the system over the years, both lower-level system features and higher-level user-facing features. Some example projects I led include the integration with Uber's service authentication and authorization, making it much easier for upstream systems to use Tokenizer; the migration of users' payment cards in their Postmates wallets after Uber acquired Postmates; and building a secure banking API for the Uber Bank project.","highlights":["PCI compliance","Cyber security","Payments","Fintech"]},{"name":"Lucipher","position":"Co-founder","url":"https://web.archive.org/web/20160320234046/https://lucipher.net/","startDate":"2013-03","endDate":"2016-02","summary":"Inspired by <a href=\"https://en.wikipedia.org/wiki/Edward_Snowden\">the Snowden leaks</a>, Lucipher was a startup that addressed the need for end-to-end secure and confidential cloud-based file storage and collaboration. The company built and provided an online (NFS-based) file system that could be mounted locally, complete with identity management and exchange, all secured with a hybrid cryptosystem that was completely transparent and could be inspected on the wire. In other words: a verifiably secure, zero-trust system. Lucipher won an IBM innovation prize and was featured in a number of online and printed publications, but was not able to gain enough traction to survive. See (Dutch language) interviews in <a href=\"/assets/pdf/ag-artikel.pdf\">Automatiseringsgids</a>, <a href=\"/assets/pdf/ibm_inspire_article.pdf\">IBM Inspire</a> and <a href=\"https://www.computable.nl/2013/06/21/lucipher-wint-innovatiewedstrijd-ibm/\">Computable</a>","highlights":["Cyber Security","File Systems","OpenPGP","Big Data"]},{"name":"Bottledbits","position":"Freelance [Software Engineer | Consultant | TPM]","startDate":"2006-06","endDate":"Present","summary":"I have done a number of freelance projects for different clients, and in different roles. Some of my clients include FEI Company (now <a href=\"https://www.thermofisher.com/nl/en/home/electron-microscopy.html\">ThermoFisher</a>), <a href=\"https://ing.com/\">ING</a>'s Global CISO organisation, the <a href=\"https://www.amsterdam.nl/bestuur-organisatie/organisatie/overige/datalab-amsterdam/\">Datalab</a> of City of Amsterdam, the Department of Traffic Management of the City of The Hague, the <a href=\"https://irlab.science.uva.nl/about/information-and-language-processing-systems-group/\">Information and Language Processing Systems (ILPS) group</a> at the University of Amsterdam, and others. See the projects section below for a selection of some of the more prominent work.","highlights":["Cyber Security","Big Data","Intrusion Detection","Open Gov Data"]},{"name":"SARA / SURFSara / SURF","url":"https://surfsara.nl/","position":"Scientific consultant","startDate":"2008-10","endDate":"2013-03","summary":"SARA, now part of SURF, is the Dutch national centre for high-performance computing (HPC) and owns all national scientific computing infrastructure. At SARA I worked with academic researchers across different disciplines, including High Energy Physics, Astronomy, Bioinformatics, Information Retrieval, Ecology, and others. It was my job to help solve very large-scale computational problems on some of the largest distributed systems in the world. In 2010, with national funding, I created a new team to build what was then the largest Hadoop cluster in The Netherlands, to better serve researchers with relatively trivial (often machine learning heavy) processing of extremely large datasets, including genome sequences, web crawls (the complete <a href=\"https://commoncrawl.org/\">Common Crawl</a> and <a href=\"https://lemurproject.org/clueweb09.php/\">ClueWeb'09</a> datasets), and other popular datasets. As part of my work at SARA I organized a number of training events in large-scale scientific computing for (post)grad students and professionals.","highlights":["HPC","Supercomputing","Hadoop","Big Data","Science","Teaching"]}],"projects":[{"name":"Amsterdam AuthZ","summary":"An OAuth 2.0 compatible authorization service written in Go. This service: <b>I)</b> implements the implicit flow as described in RFC6749 section 4.2, <b>II)</b> Uses JSON Web Keys (RFC7517) for key management, <b>III)</b>Creates JSON Web Tokens (RFC7519) using HMAC or ECDSA (HS256, HS384, HS512, ES256, ES384, ES512), and <b>IV)</b>Provides interfaces for identity providers, state storage (with implementations for single node in-memory storage and Redis), authorization providers (to map users to scopes) and client registries.","highlights":["OAuth 2.0","Authorization","Microservices","Open Gov Data"],"startDate":"2017-07","endDate":"2018-06","url":"https://amsterdam.github.io/projects/authz/"},{"name":"Core Intel","summary":"An intrusion detection system that detects possible malicious activity on the internal ING network using both open- and closed source threat intelligence, and that analyzes traffic patterns of strategically collected, large volumes of Netflow (V5).","highlights":["Cyber Security","Netflow","Threat detection"],"startDate":"2014-10","endDate":"2016-03","url":"https://www.ing.com"},{"name":"Semanticizer","summary":"A service for real-time semantic linking. It is able to take in a text stream, and return links to online resources (such as Wikipedia) that provide background information on the subject(s) of the input, including heuristic measures that estimate the likelihood of a link being correct. See more background in \"<a href=\"https://s.yimg.com/ge/labs/v2/uploads/oair2013-linking.pdf\">Feeding the Second Screen: Semantic Linking based on Subtitles</a>\" <i>(D. Odijk, E. Meij, M. de Rijke, University of Amsterdam, 2013)</i>.","highlights":["Named Entity Recognition","NLP","Machine Learning"],"startDate":"2012-11","endDate":"2013-11","url":"https://web.archive.org/web/20170803054521/http://semanticize.uva.nl/doc/"},{"name":"LifeWatch.eu","summary":"I did technical management for LifeWatch-NL, a project within the European Strategy Forum on Research Infrastructures (ESFRI). LifeWatch is a collaborative effort aiming to improve usage of modern technologies within European biodiversity research.","highlights":["Research Infrastructure","Biodiversity","EU"],"startDate":"2011-03","endDate":"2013-03","url":"https://www.lifewatch.eu//"}],"education":[{"institution":"NHL Stenden","location":"Netherlands","url":"https://www.nhlstenden.com/en","area":"Software Engineering","studyType":"BEng","startDate":"2003-02","endDate":"2006-06"},{"institution":"Budapest University of Technology and Engineering","location":"Hungary","url":"https://www.bme.hu/en","area":"Computer Science","studyType":"Erasmus scholarship, Leonardo scholarship","startDate":"2004-09","endDate":"2006-06"}],"skills":[{"name":"Engineering","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Product-minded engineering and collaboration","Architecture and system design","Collaborative execution","Infrastructure and devops","Staged CI/CD, monitoring and alerting","Async, evented and concurrent distributed systems","Relational, NoSQL, vector and graph databases","Spark, Hadoop, Kafka, PyTorch","Unit-, integration- and property-based testing"]},{"name":"Leadership","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Vision and mission","Interdisciplinary collaborative planning","Risk mitigation and iterative execution","Tactical and strategical trade offs","Incident response and blameless postmortems","Mentorship and coaching","Psychological safety and personal growth"]}],"publications":[{"name":"Life Sciences & The Dutch Grid: An Analysis from a Grid Supporter's Perspective.","publisher":"IWPLS","releaseDate":"2009-09-14","url":"https://ceur-ws.org/Vol-513/paper07.pdf","summary":"An (in hindsight naive) analysis of the suitability of the LHC Compute Grid for use cases other than High Energy Physics - in this case the life sciences."},{"name":"Mechatronic systems in sheet metal forming","publisher":"Proceedings of Manufacturing 2006, Budapest (Gyártás-2006 Konferenciára),","releaseDate":"2006-11-28","url":"https://eprints.sztaki.hu/4884/","summary":"Report on real-time coupling and coordinated controlling (CNC) of two milling machines, within the EU FP7-funded research project <a href=\"https://cordis.europa.eu/project/id/14026/reporting\">SCULPTOR</a>."}]}